Tekla Open API Reference for Tekla Structures 2025
AnalysisModelAnalysisProperties Class
 The AnalysisModelAnalysisProperties class contains the analysis property information for an analysis model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisModelAnalysisProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisModelAnalysisProperties
Public NotInheritable Class AnalysisModelAnalysisProperties
The AnalysisModelAnalysisProperties type exposes the following members.
Constructors
Name | Description
AnalysisModelAnalysisProperties
 Creates a new analysis model analysis properties instance.
Top
Properties
Name | Description
AccuracyOfIterations
 The accuracy of the iterations.
AnalysisMethod
 The analysis method.
MaxIterations
 The maximum number of iterations.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace